---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodRaySegLengthZ
source: html/ce9f181f-5442-c575-fa06-f4f51d8c59ef.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodRaySegLengthZ Property

The property labeled "Length (cm) of z segment containing one ray" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodRaySegLengthZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".